package com.zzccaidp.enums;

import com.zzccaidp.common.exception.ErrCodeBaseEnum;

/**
 * 错误码定义，请自行参考《奇迹暖暖银行应用系统错误码规范》扩展定义
 *
 * @author bades
 */
public enum ErrCodeEnum implements ErrCodeBaseEnum {

    /**
     * 交易错误码定义
     */
    M0001("0001", "用户不存在"),
    M0002("0002", "密码错误"),
    M0003("0003", "SSO解密失败"),
    M0004("0004", "生成菜单排序号错误"),
    M0005("0005", "输入参数错误"),
    M0006("0006", "参数key重复"),
    M0007("0007", "获取历史会话异常"),
    M0008("0008", "删除历史会话异常"),
    M0009("0009", "获取会话消息异常"),
    M0010("0010", "对话失败"),
    M0011("0011", "参数校验失败，参数[{}]未输入"),
    M0012("0012", "只能文档纠错失败，请与管理员联系"),
    M0013("0013", "纠错的附件和文本内容只能上传一个"),
    M0014("0014", "OA文件不存在"),
    M0016("0016", "用户密码登录方式已禁用，请从OA系统跳转"),
    M0015("0015", "人工审核库不参与向量化，请根据文档内容将其分类至对应知识库内"),
    M0017("0017", "被删除文档不存在，docId：{}"),
    M0018("0018", "OA权限处理失败，行数：{}"),
    M0019("0019", "模板保存失败"),
    M0020("0020", "当前用户已存在，无法添加"),
    M0021("0021", "部分或全部文档处理失败"),
    M0401("0401", "当前用户未认证"),
    M1000("1000", "输入参数错误"),
    M1001("1001", "入参不能为空"),
    M1035("1035", "上传文件失败，请检查"),
    M1036("1036", "下载文件失败"),
    M1049("1049", "上传识别结果文件路径为空，请检查"),

    M2011("2011", "文件识别内容为空"),

    M3005("3005", "文件解析数据写入异常"),
    M4003("4003", "AI解析历史文件超过最大限制，请删除后重新上传"),
    M8001("8001", "数据源名称已被占用"),
    M8002("8002", "数据源不存在"),
    M8003("8003", "数据源类型非法"),
    M8004("8004", "表名称已被占用"),
    M8005("8005", "表不存在"),
    M8006("8006", "表规则名称已被占用"),
    M8007("8007", "表规则不存在"),


    M7001("7001", "ragflow更新文档失败"),
    M7002("7002", "ragflow上传文档失败"),
    M7003("7003", "ragflow文档解析失败"),
    M7004("7004", "ragflow删除文档失败"),
    M7005("7005", "数据集不存在"),
    M7006("7006", "ragflow更新文档元数据失败"),
    M7007("7007", "ragflow创建数据集失败"),
    M7101("7101", "wps获取预览链接失败"),
    M7102("7102", "文件不存在"),
    M7103("7103", "文件源类型不存在"),
    M7104("7104", "文件下载失败"),
    M7108("7108", "个人知识库同步任务正在执行中"),
    M2013("2013", "模板信息已存在"),
    M9001("9001", "系统执行异常"),
    M9002("9002", "安全校验失败"),
    M9014("9014", "规则编号已存在"),
    M9015("9015", "规则不存在"),
    M9017("9017", "aws文件删除失败"),
    M9016("9016", "上传文件标识符不能为空"),
    M9018("9018", "DIFY工作流识别任务执行失败"),
    M9995("9995", "文件不存在"),
    M9996("9996", "sha256获取失败"),
    M9997("9997", "接口调用超时"),
    M9998("9998", "调用外部第三方服务请求失败"),
    SUCCESS("0000", "交易成功"),
    ERROR("9999", "系统异常");


    /**
     * 可根据自己系统定义更改错误码前缀，具体参考《奇迹暖暖银行应用系统错误码规范》
     */
    private final String errCode;
    private final String errMsg;

    private ErrCodeEnum(String errCode, String errMsg) {
        this.errCode = errCode;
        this.errMsg = errMsg;
    }

    @Override
    public String getErrCode() {
        return "AI" + errCode;
    }

    @Override
    public String getErrMsg() {
        return errMsg;
    }

}
